MCUdude/MegaCoreX/megaavr/boards.txt
####################
#### ATmega3208 ####
####################

# General
3208.name=Atmega3208
3208.upload.tool=avrdude
3208.upload.maximum_size=32768
3208.upload.maximum_data_size=4096
3208.upload.speed=115200
3208.bootloader.tool=avrdude
3208.build.core=coreX-corefiles
3208.build.board=AVR_ATmega3208
3208.build.mcu=atmega3208
3208.build.extra_flags={build.oscillator}

# Fuses we don't need to modify in the tools menu
3208.bootloader.WDTCFG=0x00
3208.bootloader.TCD0CFG=0x00
3208.bootloader.SYSCFG1=0x06
3208.bootloader.APPEND=0x00
3208.bootloader.BOOTEND=0x00
3208.bootloader.LOCKBIT=0xC5

# Pinouts
3208.menu.pinout.32pin_standard=32 pin standard
3208.menu.pinout.32pin_standard.build.variant=32pin-standard
3208.menu.pinout.28pin_standard=28 pin standard
3208.menu.pinout.28pin_standard.build.variant=28pin-standard

# Reset pin
3208.menu.resetpin.reset=Reset
3208.menu.resetpin.reset.bootloader.SYSCFG0=0xCD
3208.menu.resetpin.gpio=GPIO
3208.menu.resetpin.gpio.bootloader.SYSCFG0=0xC5

# Brown out detection
3208.menu.BOD.2v6=BOD 2.6V
3208.menu.BOD.2v6.bootloader.BODCFG=0x54
3208.menu.BOD.4v2=BOD 4.2V
3208.menu.BOD.4v2.bootloader.BODCFG=0xF4
3208.menu.BOD.4v0=BOD 4.0V
3208.menu.BOD.4v0.bootloader.BODCFG=0xD4
3208.menu.BOD.3v7=BOD 3.7V
3208.menu.BOD.3v7.bootloader.BODCFG=0xB4
3208.menu.BOD.3v3=BOD 3.3V
3208.menu.BOD.3v3.bootloader.BODCFG=0x94
3208.menu.BOD.2v9=BOD 2.9V
3208.menu.BOD.2v9.bootloader.BODCFG=0x74
3208.menu.BOD.2v1=BOD 2.1V
3208.menu.BOD.2v1.bootloader.BODCFG=0x34
3208.menu.BOD.1v8=BOD 1.8V
3208.menu.BOD.1v8.bootloader.BODCFG=0x14
3208.menu.BOD.disabled=BOD disabled
3208.menu.BOD.disabled.bootloader.BODCFG=0x00

# Clock
3208.menu.clock.internal_16MHz=Internal 16 MHz
3208.menu.clock.internal_16MHz.upload.speed=115200
3208.menu.clock.internal_16MHz.bootloader.OSCCFG=0x01
3208.menu.clock.internal_16MHz.build.oscillator=
3208.menu.clock.internal_16MHz.build.f_cpu=16000000L

3208.menu.clock.internal_20MHz=Internal 20 MHz
3208.menu.clock.internal_20MHz.upload.speed=115200
3208.menu.clock.internal_20MHz.bootloader.OSCCFG=0x02
3208.menu.clock.internal_20MHz.build.oscillator=
3208.menu.clock.internal_20MHz.build.f_cpu=20000000L

3208.menu.clock.internal_8MHz_div=Internal 8 MHz
3208.menu.clock.internal_8MHz_div.upload.speed=115200
3208.menu.clock.internal_8MHz_div.bootloader.OSCCFG=0x01
3208.menu.clock.internal_8MHz_div.build.oscillator=
3208.menu.clock.internal_8MHz_div.build.f_cpu=8000000L

3208.menu.clock.internal_4MHz_div=Internal 4 MHz
3208.menu.clock.internal_4MHz_div.upload.speed=115200
3208.menu.clock.internal_4MHz_div.bootloader.OSCCFG=0x01
3208.menu.clock.internal_4MHz_div.build.oscillator=
3208.menu.clock.internal_4MHz_div.build.f_cpu=4000000L

3208.menu.clock.internal_2MHz_div=Internal 2 MHz
3208.menu.clock.internal_2MHz_div.upload.speed=115200
3208.menu.clock.internal_2MHz_div.bootloader.OSCCFG=0x01
3208.menu.clock.internal_2MHz_div.build.oscillator=
3208.menu.clock.internal_2MHz_div.build.f_cpu=2000000L

3208.menu.clock.internal_1MHz_div=Internal 1 MHz
3208.menu.clock.internal_1MHz_div.upload.speed=115200
3208.menu.clock.internal_1MHz_div.bootloader.OSCCFG=0x01
3208.menu.clock.internal_1MHz_div.build.oscillator=
3208.menu.clock.internal_1MHz_div.build.f_cpu=1000000L

3208.menu.clock.external_16MHz=External 16 MHz
3208.menu.clock.external_16MHz.upload.speed=115200
3208.menu.clock.external_16MHz.bootloader.OSCCFG=0x01
3208.menu.clock.external_16MHz.build.oscillator=-DUSE_EXTERNAL_OSCILLATOR
3208.menu.clock.external_16MHz.build.f_cpu=16000000L

3208.menu.clock.external_12MHz=External 12 MHz
3208.menu.clock.external_12MHz.upload.speed=115200
3208.menu.clock.external_12MHz.bootloader.OSCCFG=0x01
3208.menu.clock.external_12MHz.build.oscillator=-DUSE_EXTERNAL_OSCILLATOR
3208.menu.clock.external_12MHz.build.f_cpu=12000000L

3208.menu.clock.external_8MHz=External 8 MHz
3208.menu.clock.external_8MHz.upload.speed=115200
3208.menu.clock.external_8MHz.bootloader.OSCCFG=0x01
3208.menu.clock.external_8MHz.build.oscillator=-DUSE_EXTERNAL_OSCILLATOR
3208.menu.clock.external_8MHz.build.f_cpu=8000000L

3208.menu.clock.external_4MHz=External 4 MHz
3208.menu.clock.external_4MHz.upload.speed=115200
3208.menu.clock.external_4MHz.bootloader.OSCCFG=0x01
3208.menu.clock.external_4MHz.build.oscillator=-DUSE_EXTERNAL_OSCILLATOR
3208.menu.clock.external_4MHz.build.f_cpu=4000000L

3208.menu.clock.external_1MHz=External 1 MHz
3208.menu.clock.external_1MHz.upload.speed=115200
3208.menu.clock.external_1MHz.bootloader.OSCCFG=0x01
3208.menu.clock.external_1MHz.build.oscillator=-DUSE_EXTERNAL_OSCILLATOR
3208.menu.clock.external_1MHz.build.f_cpu=1000000L



#####################
#### ATmega1609 ####
#####################

# General
1609.name=Atmega1609
1609.upload.tool=avrdude
1609.upload.maximum_size=16384
1609.upload.maximum_data_size=2048
1609.upload.speed=115200
1609.bootloader.tool=avrdude
1609.build.core=coreX-corefiles
1609.build.board=AVR_ATmega1609
1609.build.mcu=atmega1609
1609.build.extra_flags={build.oscillator} {build.compat}

# Fuses we don't need to modify in the tools menu
1609.bootloader.WDTCFG=0x00
1609.bootloader.TCD0CFG=0x00
1609.bootloader.SYSCFG1=0x06
1609.bootloader.APPEND=0x00
1609.bootloader.BOOTEND=0x00
1609.bootloader.LOCKBIT=0xC5

# Pinouts
1609.menu.pinout.48pin_standard=40/48 pin standard
1609.menu.pinout.48pin_standard.build.variant=48pin-standard
1609.menu.pinout.48pin_standard.build.compat=
1609.menu.pinout.uno_wifi=Uno WiFi
1609.menu.pinout.uno_wifi.build.variant=uno-wifi
1609.menu.pinout.uno_wifi.build.compat=

# Reset pin
1609.menu.resetpin.reset=Reset
1609.menu.resetpin.reset.bootloader.SYSCFG0=0xCD
1609.menu.resetpin.gpio=GPIO
1609.menu.resetpin.gpio.bootloader.SYSCFG0=0xC5

# Brown out detection
1609.menu.BOD.2v6=BOD 2.6V
1609.menu.BOD.2v6.bootloader.BODCFG=0x54
1609.menu.BOD.4v2=BOD 4.2V
1609.menu.BOD.4v2.bootloader.BODCFG=0xF4
1609.menu.BOD.4v0=BOD 4.0V
1609.menu.BOD.4v0.bootloader.BODCFG=0xD4
1609.menu.BOD.3v7=BOD 3.7V
1609.menu.BOD.3v7.bootloader.BODCFG=0xB4
1609.menu.BOD.3v3=BOD 3.3V
1609.menu.BOD.3v3.bootloader.BODCFG=0x94
1609.menu.BOD.2v9=BOD 2.9V
1609.menu.BOD.2v9.bootloader.BODCFG=0x74
1609.menu.BOD.2v1=BOD 2.1V
1609.menu.BOD.2v1.bootloader.BODCFG=0x34
1609.menu.BOD.1v8=BOD 1.8V
1609.menu.BOD.1v8.bootloader.BODCFG=0x14
1609.menu.BOD.disabled=BOD disabled
1609.menu.BOD.disabled.bootloader.BODCFG=0x00

# Clock
1609.menu.clock.internal_16MHz=Internal 16 MHz
1609.menu.clock.internal_16MHz.upload.speed=115200
1609.menu.clock.internal_16MHz.bootloader.OSCCFG=0x01
1609.menu.clock.internal_16MHz.build.oscillator=
1609.menu.clock.internal_16MHz.build.f_cpu=16000000L

1609.menu.clock.internal_20MHz=Internal 20 MHz
1609.menu.clock.internal_20MHz.upload.speed=115200
1609.menu.clock.internal_20MHz.bootloader.OSCCFG=0x02
1609.menu.clock.internal_20MHz.build.oscillator=
1609.menu.clock.internal_20MHz.build.f_cpu=20000000L

1609.menu.clock.internal_8MHz_div=Internal 8 MHz
1609.menu.clock.internal_8MHz_div.upload.speed=115200
1609.menu.clock.internal_8MHz_div.bootloader.OSCCFG=0x01
1609.menu.clock.internal_8MHz_div.build.oscillator=
1609.menu.clock.internal_8MHz_div.build.f_cpu=8000000L

1609.menu.clock.internal_4MHz_div=Internal 4 MHz
1609.menu.clock.internal_4MHz_div.upload.speed=115200
1609.menu.clock.internal_4MHz_div.bootloader.OSCCFG=0x01
1609.menu.clock.internal_4MHz_div.build.oscillator=
1609.menu.clock.internal_4MHz_div.build.f_cpu=4000000L

1609.menu.clock.internal_2MHz_div=Internal 2 MHz
1609.menu.clock.internal_2MHz_div.upload.speed=115200
1609.menu.clock.internal_2MHz_div.bootloader.OSCCFG=0x01
1609.menu.clock.internal_2MHz_div.build.oscillator=
1609.menu.clock.internal_2MHz_div.build.f_cpu=2000000L

