MCUdude/MegaCoreX/megaavr/boards.txt
809.menu.clock.internal_8MHz_div=Internal 8 MHz
809.menu.clock.internal_8MHz_div.upload.speed=115200
809.menu.clock.internal_8MHz_div.bootloader.OSCCFG=0x01
809.menu.clock.internal_8MHz_div.build.oscillator=
809.menu.clock.internal_8MHz_div.build.f_cpu=8000000L

809.menu.clock.internal_4MHz_div=Internal 4 MHz
809.menu.clock.internal_4MHz_div.upload.speed=115200
809.menu.clock.internal_4MHz_div.bootloader.OSCCFG=0x01
809.menu.clock.internal_4MHz_div.build.oscillator=
809.menu.clock.internal_4MHz_div.build.f_cpu=4000000L

809.menu.clock.internal_2MHz_div=Internal 2 MHz
809.menu.clock.internal_2MHz_div.upload.speed=115200
809.menu.clock.internal_2MHz_div.bootloader.OSCCFG=0x01
809.menu.clock.internal_2MHz_div.build.oscillator=
809.menu.clock.internal_2MHz_div.build.f_cpu=2000000L

809.menu.clock.internal_1MHz_div=Internal 1 MHz
809.menu.clock.internal_1MHz_div.upload.speed=115200
809.menu.clock.internal_1MHz_div.bootloader.OSCCFG=0x01
809.menu.clock.internal_1MHz_div.build.oscillator=
809.menu.clock.internal_1MHz_div.build.f_cpu=1000000L

809.menu.clock.external_16MHz=External 16 MHz
809.menu.clock.external_16MHz.upload.speed=115200
809.menu.clock.external_16MHz.bootloader.OSCCFG=0x01
809.menu.clock.external_16MHz.build.oscillator=-DUSE_EXTERNAL_OSCILLATOR
809.menu.clock.external_16MHz.build.f_cpu=16000000L

809.menu.clock.external_12MHz=External 12 MHz
809.menu.clock.external_12MHz.upload.speed=115200
809.menu.clock.external_12MHz.bootloader.OSCCFG=0x01
809.menu.clock.external_12MHz.build.oscillator=-DUSE_EXTERNAL_OSCILLATOR
809.menu.clock.external_12MHz.build.f_cpu=12000000L

809.menu.clock.external_8MHz=External 8 MHz
809.menu.clock.external_8MHz.upload.speed=115200
809.menu.clock.external_8MHz.bootloader.OSCCFG=0x01
809.menu.clock.external_8MHz.build.oscillator=-DUSE_EXTERNAL_OSCILLATOR
809.menu.clock.external_8MHz.build.f_cpu=8000000L

809.menu.clock.external_4MHz=External 4 MHz
809.menu.clock.external_4MHz.upload.speed=115200
809.menu.clock.external_4MHz.bootloader.OSCCFG=0x01
809.menu.clock.external_4MHz.build.oscillator=-DUSE_EXTERNAL_OSCILLATOR
809.menu.clock.external_4MHz.build.f_cpu=4000000L

809.menu.clock.external_1MHz=External 1 MHz
809.menu.clock.external_1MHz.upload.speed=115200
809.menu.clock.external_1MHz.bootloader.OSCCFG=0x01
809.menu.clock.external_1MHz.build.oscillator=-DUSE_EXTERNAL_OSCILLATOR
809.menu.clock.external_1MHz.build.f_cpu=1000000L



###################
#### ATmega808 ####
###################

# General
808.name=Atmega808
808.upload.tool=avrdude
808.upload.maximum_size=8192
808.upload.maximum_data_size=1024
808.upload.speed=115200
808.bootloader.tool=avrdude
808.build.core=coreX-corefiles
808.build.board=AVR_ATmega808
808.build.mcu=atmega808
808.build.extra_flags={build.oscillator}

# Fuses we don't need to modify in the tools menu
808.bootloader.WDTCFG=0x00
808.bootloader.TCD0CFG=0x00
808.bootloader.SYSCFG1=0x06
808.bootloader.APPEND=0x00
808.bootloader.BOOTEND=0x00
808.bootloader.LOCKBIT=0xC5

# Pinouts
808.menu.pinout.32pin_standard=32 pin standard
808.menu.pinout.32pin_standard.build.variant=32pin-standard
808.menu.pinout.28pin_standard=28 pin standard
808.menu.pinout.28pin_standard.build.variant=28pin-standard

# Reset pin
808.menu.resetpin.reset=Reset
808.menu.resetpin.reset.bootloader.SYSCFG0=0xCD
808.menu.resetpin.gpio=GPIO
808.menu.resetpin.gpio.bootloader.SYSCFG0=0xC5

# Brown out detection
808.menu.BOD.2v6=BOD 2.6V
808.menu.BOD.2v6.bootloader.BODCFG=0x54
808.menu.BOD.4v2=BOD 4.2V
808.menu.BOD.4v2.bootloader.BODCFG=0xF4
808.menu.BOD.4v0=BOD 4.0V
808.menu.BOD.4v0.bootloader.BODCFG=0xD4
808.menu.BOD.3v7=BOD 3.7V
808.menu.BOD.3v7.bootloader.BODCFG=0xB4
808.menu.BOD.3v3=BOD 3.3V
808.menu.BOD.3v3.bootloader.BODCFG=0x94
808.menu.BOD.2v9=BOD 2.9V
808.menu.BOD.2v9.bootloader.BODCFG=0x74
808.menu.BOD.2v1=BOD 2.1V
808.menu.BOD.2v1.bootloader.BODCFG=0x34
808.menu.BOD.1v8=BOD 1.8V
808.menu.BOD.1v8.bootloader.BODCFG=0x14
808.menu.BOD.disabled=BOD disabled
808.menu.BOD.disabled.bootloader.BODCFG=0x00

# Clock
808.menu.clock.internal_16MHz=Internal 16 MHz
808.menu.clock.internal_16MHz.upload.speed=115200
808.menu.clock.internal_16MHz.bootloader.OSCCFG=0x01
808.menu.clock.internal_16MHz.build.oscillator=
808.menu.clock.internal_16MHz.build.f_cpu=16000000L

808.menu.clock.internal_20MHz=Internal 20 MHz
808.menu.clock.internal_20MHz.upload.speed=115200
808.menu.clock.internal_20MHz.bootloader.OSCCFG=0x02
808.menu.clock.internal_20MHz.build.oscillator=
808.menu.clock.internal_20MHz.build.f_cpu=20000000L

808.menu.clock.internal_8MHz_div=Internal 8 MHz
808.menu.clock.internal_8MHz_div.upload.speed=115200
808.menu.clock.internal_8MHz_div.bootloader.OSCCFG=0x01
808.menu.clock.internal_8MHz_div.build.oscillator=
808.menu.clock.internal_8MHz_div.build.f_cpu=8000000L

808.menu.clock.internal_4MHz_div=Internal 4 MHz
808.menu.clock.internal_4MHz_div.upload.speed=115200
808.menu.clock.internal_4MHz_div.bootloader.OSCCFG=0x01
808.menu.clock.internal_4MHz_div.build.oscillator=
808.menu.clock.internal_4MHz_div.build.f_cpu=4000000L

808.menu.clock.internal_2MHz_div=Internal 2 MHz
808.menu.clock.internal_2MHz_div.upload.speed=115200
808.menu.clock.internal_2MHz_div.bootloader.OSCCFG=0x01
808.menu.clock.internal_2MHz_div.build.oscillator=
808.menu.clock.internal_2MHz_div.build.f_cpu=2000000L

808.menu.clock.internal_1MHz_div=Internal 1 MHz
808.menu.clock.internal_1MHz_div.upload.speed=115200
808.menu.clock.internal_1MHz_div.bootloader.OSCCFG=0x01
808.menu.clock.internal_1MHz_div.build.oscillator=
808.menu.clock.internal_1MHz_div.build.f_cpu=1000000L

808.menu.clock.external_16MHz=External 16 MHz
808.menu.clock.external_16MHz.upload.speed=115200
808.menu.clock.external_16MHz.bootloader.OSCCFG=0x01
808.menu.clock.external_16MHz.build.oscillator=-DUSE_EXTERNAL_OSCILLATOR
808.menu.clock.external_16MHz.build.f_cpu=16000000L

808.menu.clock.external_12MHz=External 12 MHz
808.menu.clock.external_12MHz.upload.speed=115200
808.menu.clock.external_12MHz.bootloader.OSCCFG=0x01
808.menu.clock.external_12MHz.build.oscillator=-DUSE_EXTERNAL_OSCILLATOR
808.menu.clock.external_12MHz.build.f_cpu=12000000L

808.menu.clock.external_8MHz=External 8 MHz
808.menu.clock.external_8MHz.upload.speed=115200
808.menu.clock.external_8MHz.bootloader.OSCCFG=0x01
808.menu.clock.external_8MHz.build.oscillator=-DUSE_EXTERNAL_OSCILLATOR
808.menu.clock.external_8MHz.build.f_cpu=8000000L

808.menu.clock.external_4MHz=External 4 MHz
808.menu.clock.external_4MHz.upload.speed=115200
808.menu.clock.external_4MHz.bootloader.OSCCFG=0x01
808.menu.clock.external_4MHz.build.oscillator=-DUSE_EXTERNAL_OSCILLATOR
808.menu.clock.external_4MHz.build.f_cpu=4000000L

808.menu.clock.external_1MHz=External 1 MHz
808.menu.clock.external_1MHz.upload.speed=115200
808.menu.clock.external_1MHz.bootloader.OSCCFG=0x01
808.menu.clock.external_1MHz.build.oscillator=-DUSE_EXTERNAL_OSCILLATOR
808.menu.clock.external_1MHz.build.f_cpu=1000000L
